[Killed] LogicalOperator
main/pages/Meal/MealTimesPage.jsx:16:5
   // Check if it's a specific error related to closed dining commons
   // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
   const isClosedDiningCommons =
-    error.response?.status === 404 ||
-    error.response?.status === 500 ||
-    // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-    error.response?.data?.message?.toLowerCase().includes("no meals") ||
+    (error.response?.status === 404 || error.response?.status === 500) &&
+// Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
+error.response?.data?.message?.toLowerCase().includes("no meals") ||
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("closed");
killedBy: onMealsError tests shows user-friendly message for 404 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "carrillo is not serving meals on 2025-08-16. Please try a different date or dining commons.",

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:17:5
   // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
   const isClosedDiningCommons =
     error.response?.status === 404 ||
-    error.response?.status === 500 ||
+    false ||
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("no meals") ||
killedBy: onMealsError tests shows user-friendly message for 500 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "ortega is not serving meals on 2025-12-25. Please try a different date or dining commons.",

[Killed] BlockStatement
main/pages/Meal/MealTimesPage.jsx:23:30
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("closed");
 
-  if (isClosedDiningCommons) {
-    // Show user-friendly message for closed dining commons
-    toast.error(
-      `${diningCommonsCode} is not serving meals on ${dateTime}. Please try a different date or dining commons.`,
-    );
-  } else {
+  if (isClosedDiningCommons) {} else {
     // Show generic error message for other types of errors
     // Stryker disable all : Fallback message with OR operator and optional chaining is defensive coding
killedBy: onMealsError tests shows user-friendly message for 404 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:68:7
   );
 
   // Handle error state (dining commons closed, network issues, etc.)
-  if (error) {
+  if (true) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
killedBy: MealTimesPage tests renders without crashing
statusReason: Cannot read properties of null (reading 'response')

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:71:7
   if (error) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
-      error.response?.status === 404 ||
-      error.response?.status === 500 ||
-      // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-      error.response?.data?.message?.toLowerCase().includes("no meals") ||
+      false ||
       // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
       error.response?.data?.message?.toLowerCase().includes("closed");
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
