[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:68:7
   );
 
   // Handle error state (dining commons closed, network issues, etc.)
-  if (error) {
+  if (false) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:71:7
   if (error) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
-      error.response?.status === 404 ||
-      error.response?.status === 500 ||
+      false ||
       // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
       error.response?.data?.message?.toLowerCase().includes("no meals") ||
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
