[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:65:16
                   </NavDropdown>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <>
-                  <NavDropdown
-                    title="Moderate"
-                    id="appnavbar-moderate-dropdown"
-                    data-testid="appnavbar-moderate-dropdown"
-                  >
-                    <NavDropdown.Item href="/moderate">
-                      Moderator Menu
-                    </NavDropdown.Item>
-                    <NavDropdown.Item href="/moderate/reviews">
-                      Moderator Reviews
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_MODERATOR") || <>
+                  <NavDropdown title="Moderate" id="appnavbar-moderate-dropdown" data-testid="appnavbar-moderate-dropdown">
+                    <NavDropdown.Item href="/moderate">
+                      Moderator Menu
+                    </NavDropdown.Item>
+                    <NavDropdown.Item href="/moderate/reviews">
+                      Moderator Reviews
+                    </NavDropdown.Item>
+                  </NavDropdown>
+                </>}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  aria-expanded="false"
  class="dropdown-toggle nav-link"
  href="#"
  id="appnavbar-moderate-dropdown"
  role="button"
