[Killed] ConditionalExpression
main/components/Reviews/ReviewsTable.jsx:83:19
             Header: "Status",
             accessor: "status",
             Cell: ({ value }) => {
-              if (!value) return "";
+              if (false) return "";
               return <span>{String(value).replace(/_/g, " ")}</span>;
             },
killedBy: ReviewsTable tests Shows empty status when status is missing
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  null
