[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:16:26
   reviews,
   userOptions,
   moderatorOptions,
-  showModerationStatus = false,
+  showModerationStatus = true,
 }) {
   const navigate = useNavigate();
killedBy: ReviewsTable tests Does not show status column by default
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="Reviewstable-header-status"
  role="columnheader"
  style="cursor: pointer;"
  title="Toggle SortBy"

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:82:34
           {
             Header: "Status",
             accessor: "status",
-            Cell: ({ value }) => {
-              if (!value) return "";
-              return <span>{String(value).replace(/_/g, " ")}</span>;
-            },
+            Cell: ({ value }) => {},
           },
         ]
killedBy: ReviewsTable tests Shows moderation status column when requested
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  AWAITING REVIEW
Received:

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:89:5
           },
         ]
       : []),
-    {
-      Header: "Date Served",
-      accessor: "dateItemServed",
-      Cell: ({ value }) => (
-        <span>{new Date(value).toLocaleDateString("en-US")}</span>
-      ),
-    },
+    {},
     {
       Header: "Dining Commons Code",
killedBy: MyReviewsIndexPage tests renders three reviews correctly for regular user; ReviewsTable tests Has the base column headers and content; Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: A column ID (or string accessor) is required!
