[Survived] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.jsx:31:33
         <ReviewsTable
           reviews={reviews}
           userOptions={userOptions}
-          showModerationStatus={true}
+          showModerationStatus={false}
         />
       </div>
