[Killed] BlockStatement
main/components/DiningCommons/DiningCommonsTable.jsx:8:42
 import axios from "axios";
 
 // helper for “closed/no meals”
-const isClosedDiningCommons = (error) => {
-  if (!error) return false;
-  const status = error.response?.status;
-  const rawMessage = error.response?.data?.message;
-  const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
-  return status === 404 || status === 500 || msg.includes("no meals");
-};
+const isClosedDiningCommons = (error) => {};
 
 export default function DiningCommonsTable({ commons, date }) {
killedBy: DiningCommonsTable tests Uses closed-commons logic when status is 404 (no meals link even if data has meals)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:9:7
 
 // helper for “closed/no meals”
 const isClosedDiningCommons = (error) => {
-  if (!error) return false;
+  if (false) return false;
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
killedBy: DiningCommonsTable tests Has the expected column headers and basic content
statusReason: Cannot read properties of null (reading 'response')

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:9:7
 
 // helper for “closed/no meals”
 const isClosedDiningCommons = (error) => {
-  if (!error) return false;
+  if (true) return false;
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
killedBy: DiningCommonsTable tests Uses closed-commons logic when status is 404 (no meals link even if data has meals)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] OptionalChaining
main/components/DiningCommons/DiningCommonsTable.jsx:10:18
 // helper for “closed/no meals”
 const isClosedDiningCommons = (error) => {
   if (!error) return false;
-  const status = error.response?.status;
+  const status = error.response.status;
   const rawMessage = error.response?.data?.message;
   const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
killedBy: DiningCommonsTable tests Handles error without nested fields and still renders meals
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] OptionalChaining
main/components/DiningCommons/DiningCommonsTable.jsx:11:22
 const isClosedDiningCommons = (error) => {
   if (!error) return false;
   const status = error.response?.status;
-  const rawMessage = error.response?.data?.message;
+  const rawMessage = error.response.data?.message;
   const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
   return status === 404 || status === 500 || msg.includes("no meals");
killedBy: DiningCommonsTable tests Handles error without nested fields and still renders meals
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:12:15
   if (!error) return false;
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
-  const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
+  const msg = true ? rawMessage.toLowerCase() : "";
   return status === 404 || status === 500 || msg.includes("no meals");
 };
killedBy: DiningCommonsTable tests Handles error without nested fields and still renders meals
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.jsx:12:15
   if (!error) return false;
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
-  const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
+  const msg = typeof rawMessage !== "string" ? rawMessage.toLowerCase() : "";
   return status === 404 || status === 500 || msg.includes("no meals");
 };
killedBy: DiningCommonsTable tests Uses closed-commons logic when message includes 'no meals' even if status is 200
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.jsx:13:10
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
   const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
-  return status === 404 || status === 500 || msg.includes("no meals");
+  return status !== 404 || status === 500 || msg.includes("no meals");
 };
 
killedBy: DiningCommonsTable tests Uses closed-commons logic when status is 404 (no meals link even if data has meals)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:13:28
   const status = error.response?.status;
   const rawMessage = error.response?.data?.message;
   const msg = typeof rawMessage === "string" ? rawMessage.toLowerCase() : "";
-  return status === 404 || status === 500 || msg.includes("no meals");
+  return status === 404 || false || msg.includes("no meals");
 };
 
killedBy: DiningCommonsTable tests Uses closed-commons logic when status is 500 (no meals link even if data has meals)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Survived] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:25:7
 
     const { data, error, status } = useQuery(
       [url],
-      async () => (await axios.get(url)).data,
+      () => undefined,
       {
         initialData: [],

[Killed] BooleanLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:28:16
       async () => (await axios.get(url)).data,
       {
         initialData: [],
-        retry: false,
+        retry: true,
         onError: (err) =>
           console.error(`Error loading meals for ${code} on ${date}`, err),
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when data.meals is empty and useQuery called with correct args and onError logs
statusReason: expected { initialData: [], retry: true, …(1) } to deeply equal ObjectContaining{…}

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:29:18
       {
         initialData: [],
         retry: false,
-        onError: (err) =>
-          console.error(`Error loading meals for ${code} on ${date}`, err),
+        onError: () => undefined,
       },
     );
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when data.meals is empty and useQuery called with correct args and onError logs
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:34:9
       },
     );
 
-    if (status === "loading") return <span>...</span>;
+    if (true) return <span>...</span>;
 
     // if closed or error -> just say no meals offered
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when data.meals is empty and useQuery called with correct args and onError logs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  ...

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:34:9
       },
     );
 
-    if (status === "loading") return <span>...</span>;
+    if (false) return <span>...</span>;
 
     // if closed or error -> just say no meals offered
killedBy: DiningCommonsTable tests Meals cell shows loading placeholder when status is loading
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ...
Received:
  no meals offered

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:37:9
     if (status === "loading") return <span>...</span>;
 
     // if closed or error -> just say no meals offered
-    if (status === "error" || isClosedDiningCommons(error)) {
+    if (false || isClosedDiningCommons(error)) {
       return <span>no meals offered</span>;
     }
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when status is error even if meals data is present
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] LogicalOperator
main/components/DiningCommons/DiningCommonsTable.jsx:37:9
     if (status === "loading") return <span>...</span>;
 
     // if closed or error -> just say no meals offered
-    if (status === "error" || isClosedDiningCommons(error)) {
+    if (status === "error" && isClosedDiningCommons(error)) {
       return <span>no meals offered</span>;
     }
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when status is error even if meals data is present
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Lunch

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:43:18
 
     // normalize meals
     let meals = Array.isArray(data)
-      ? data.map((m) => m.name)
+      ? data.map(() => undefined)
       : data?.meals?.map((m) => m.name) || [];
 
killedBy: DiningCommonsTable tests Meals cell shows links when data is an array of objects with name
statusReason: Cannot read properties of undefined (reading 'charAt')

[Killed] LogicalOperator
main/components/DiningCommons/DiningCommonsTable.jsx:44:9
     // normalize meals
     let meals = Array.isArray(data)
       ? data.map((m) => m.name)
-      : data?.meals?.map((m) => m.name) || [];
+      : data?.meals?.map(m => m.name) && [];
 
     if (meals.length === 0) return <span>no meals offered</span>;
killedBy: DiningCommonsTable tests Meals cell shows links when data.meals is an array of objects with name
statusReason: Unable to find role="link" and name "Brunch"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:44:26
     // normalize meals
     let meals = Array.isArray(data)
       ? data.map((m) => m.name)
-      : data?.meals?.map((m) => m.name) || [];
+      : data?.meals?.map(() => undefined) || [];
 
     if (meals.length === 0) return <span>no meals offered</span>;
killedBy: DiningCommonsTable tests Meals cell shows links when data.meals is an array of objects with name
statusReason: Cannot read properties of undefined (reading 'charAt')

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:46:9
       ? data.map((m) => m.name)
       : data?.meals?.map((m) => m.name) || [];
 
-    if (meals.length === 0) return <span>no meals offered</span>;
+    if (false) return <span>no meals offered</span>;
 
     return (
killedBy: DiningCommonsTable tests Meals cell shows 'no meals offered' when data.meals is empty and useQuery called with correct args and onError logs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:

[Killed] BlockStatement
main/components/DiningCommons/DiningCommonsTable.jsx:50:30
 
     return (
       <>
-        {meals.map((meal) => {
-          const label =
-            meal.charAt(0).toUpperCase() + meal.slice(1).toLowerCase();
-          const to = `/diningcommons/${date}/${code}/${meal}`;
-          return (
-            <Link key={meal} to={to} style={{ marginRight: "0.75rem" }}>
-              {label}
-            </Link>
-          );
-        })}
+        {meals.map((meal) => {})}
       </>
     );
killedBy: DiningCommonsTable tests Meals cell shows links when data is an array of objects with name
statusReason: Unable to find role="link" and name "Lunch"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] MethodExpression
main/components/DiningCommons/DiningCommonsTable.jsx:52:13
       <>
         {meals.map((meal) => {
           const label =
-            meal.charAt(0).toUpperCase() + meal.slice(1).toLowerCase();
+            meal.toUpperCase() + meal.slice(1).toLowerCase();
           const to = `/diningcommons/${date}/${code}/${meal}`;
           return (
killedBy: DiningCommonsTable tests Meals cell shows links when data is an array of objects with name
statusReason: Unable to find role="link" and name "Lunch"

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:75:17
     { Header: "Name", accessor: "name" },
     {
       Header: "Meals Offered Today",
-      accessor: "meals",
+      accessor: "",
       Cell: (props) => <MealsCell {...props} />,
     },
killedBy: DiningCommonsTable tests Has the expected column headers and basic content
statusReason: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-meals"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
