[Killed] StringLiteral
main/pages/Meal/MealTimesPage.jsx:11:17
 /* eslint-disable react-refresh/only-export-components*/
 
 export const onMealsError = (error, diningCommonsCode, dateTime) => {
-  console.error("onMealsError: error=", error);
+  console.error("", error);
 
   // Check if it's a specific error related to closed dining commons
killedBy: onMealsError tests logs error to console
statusReason: expected "error" to be called with arguments: [ 'onMealsError: error=', …(1) ]

Received: 

  1st error call:

@@ -1,7 +1,7 @@
  [

[Killed] EqualityOperator
main/pages/Meal/MealTimesPage.jsx:16:5
   // Check if it's a specific error related to closed dining commons
   // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
   const isClosedDiningCommons =
-    error.response?.status === 404 ||
+    error.response?.status !== 404 ||
     error.response?.status === 500 ||
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
killedBy: onMealsError tests shows user-friendly message for 404 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "carrillo is not serving meals on 2025-08-16. Please try a different date or dining commons.",

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:16:5
   // Check if it's a specific error related to closed dining commons
   // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
   const isClosedDiningCommons =
-    error.response?.status === 404 ||
-    error.response?.status === 500 ||
-    // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-    error.response?.data?.message?.toLowerCase().includes("no meals") ||
-    // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-    error.response?.data?.message?.toLowerCase().includes("closed");
+    false;
 
   if (isClosedDiningCommons) {
killedBy: onMealsError tests shows user-friendly message for 404 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "carrillo is not serving meals on 2025-08-16. Please try a different date or dining commons.",

[Killed] EqualityOperator
main/pages/Meal/MealTimesPage.jsx:17:5
   // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
   const isClosedDiningCommons =
     error.response?.status === 404 ||
-    error.response?.status === 500 ||
+    error.response?.status !== 500 ||
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("no meals") ||
killedBy: onMealsError tests shows user-friendly message for 500 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "ortega is not serving meals on 2025-12-25. Please try a different date or dining commons.",

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:23:7
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("closed");
 
-  if (isClosedDiningCommons) {
+  if (false) {
     // Show user-friendly message for closed dining commons
     toast.error(
killedBy: onMealsError tests shows user-friendly message for 404 error
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "carrillo is not serving meals on 2025-08-16. Please try a different date or dining commons.",

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:23:7
     // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
     error.response?.data?.message?.toLowerCase().includes("closed");
 
-  if (isClosedDiningCommons) {
+  if (true) {
     // Show user-friendly message for closed dining commons
     toast.error(
killedBy: onMealsError tests shows generic error message for other errors with message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Access denied' ]

Received: 

  1st vi.fn() call:

  [
-   "Access denied",

[Killed] BlockStatement
main/pages/Meal/MealTimesPage.jsx:28:10
     toast.error(
       `${diningCommonsCode} is not serving meals on ${dateTime}. Please try a different date or dining commons.`,
     );
-  } else {
-    // Show generic error message for other types of errors
-    // Stryker disable all : Fallback message with OR operator and optional chaining is defensive coding
-    const message =
-      error.response?.data?.message ||
-      `Error loading meals for ${diningCommonsCode} on ${dateTime}`;
-    // Stryker restore all
-    toast.error(message);
-  }
+  } else {}
 };
 
killedBy: onMealsError tests shows generic error message for other errors with message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Access denied' ]

Number of calls: 0

[Killed] BlockStatement
main/pages/Meal/MealTimesPage.jsx:53:17
   } = useQuery(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/diningcommons/${dateTime}/${diningCommonsCode}`],
-    async () => {
-      const response = await axios.get(
-        `/api/diningcommons/${dateTime}/${diningCommonsCode}`,
-      );
-      return response.data;
-    },
+    async () => {},
     {
       retry: false,
killedBy: MealTimesPage tests displays loading screen while fetching meals
statusReason: Unable to find an accessible element with the role "link" and name "Breakfast"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ObjectLiteral
main/pages/Meal/MealTimesPage.jsx:59:5
       );
       return response.data;
     },
-    {
-      retry: false,
-      // Stryker disable next-line all : onError callback is tested via component behavior tests
-      onError: (error) => {
-        // Use custom error handler instead of generic toast spam
-        onMealsError(error, diningCommonsCode, dateTime);
-      },
-    },
+    {},
   );
 
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/Meal/MealTimesPage.jsx:60:14
       return response.data;
     },
     {
-      retry: false,
+      retry: true,
       // Stryker disable next-line all : onError callback is tested via component behavior tests
       onError: (error) => {
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:70:7
   );
 
   // Handle loading state
-  if (isLoading) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: MealTimesPage tests displays loading screen while fetching meals
statusReason: Unable to find an element with the text: Loading meal times.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Meal/MealTimesPage.jsx:92:7
   if (error) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
-      error.response?.status === 404 ||
-      error.response?.status === 500 ||
+      error.response?.status === 404 && error.response?.status === 500 ||
       // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
       error.response?.data?.message?.toLowerCase().includes("no meals") ||
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Meal/MealTimesPage.jsx:92:7
   if (error) {
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
-      error.response?.status === 404 ||
-      error.response?.status === 500 ||
-      // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-      error.response?.data?.message?.toLowerCase().includes("no meals") ||
-      // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
-      error.response?.data?.message?.toLowerCase().includes("closed");
+      (error.response?.status === 404 || error.response?.status === 500 ||
+// Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
+error.response?.data?.message?.toLowerCase().includes("no meals")) &&
+// Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
+error.response?.data?.message?.toLowerCase().includes("closed");
 
     return (
killedBy: MealTimesPage tests displays error message when dining commons is closed (404)
statusReason: Unable to find an element with the text: No meals available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Meal/MealTimesPage.jsx:93:7
     // Stryker disable next-line all : Optional chaining on error.response?.status is defensive coding
     const isClosedDiningCommons =
       error.response?.status === 404 ||
-      error.response?.status === 500 ||
+      error.response.status === 500 ||
       // Stryker disable next-line all : Optional chaining on error.response?.data?.message is defensive coding
       error.response?.data?.message?.toLowerCase().includes("no meals") ||
killedBy: MealTimesPage tests displays generic error message when no error message from backend
statusReason: Unable to find an element with the text: Error loading meals. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:136:10
         <h1>
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
-        {meals && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays loading screen while fetching meals
statusReason: Unable to find an accessible element with the role "link" and name "Breakfast"

Here are the accessible roles:

  navigation:

  Name "":
  <nav
